open_menu = '''\nГлавное меню:
            1. Показать все контакты
            2. Добавить контакт
            3. Найти контакт
            4. Изменить контакт
            5. Удалить контакт
            6. Сохранить файл
            7. Выйти из програмы\n'''

input_choice = 'Выберите пункт меню: '

successful = 'Успешно.'

pb_link = 'Теперь телефонный справочник выглядит так: '

search_link = 'Нашли следующие варианты:'
search_txt = 'Если вы хотите осуществить поиск по имени и фамилии, поставьте знак +. Если по номеру знак -.'
search_contact = 'Введите искомую информацию: '

contact_not_found = 'Контакт не обнаружен'

first_name_txt = 'Введите имя контакта: '
second_name_txt = 'Введите фамилию контакта: '
phone_number_txt = 'Введите телефон контакта: '
comment_txt = 'Введите комментарий для контакта: '

swap_information = 'Введите номер контакта, который хотите поменять: '
new_information_to_swap = 'Введите новую информацию (имя, фамилию, номер телефона, комментарий): '

del_contact = 'Введите номер строки который хотите удалить: '

save_diff = 'Хотите сохранить изменения? Введите: Y/N: '
not_save = 'Изменения отменены'